{
  "backend/main.mo": "Motoko actor managing reminders with CRUD operations and filters for active and completed items.",
  "feature_evidence.json": "Feature evidence report mapping rollback-related features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior and purpose of various frontend application files.",
  "frontend/index.css": "Tailwind CSS base layer defining light and dark theme variables and global styling.",
  "frontend/index.html": "HTML entry point that loads React and applies dark mode early based on stored customization settings.",
  "frontend/public/study-planner-mockup.html": "Standalone HTML mockup demonstrating themed UI layout and styling for the Study Planner.",
  "frontend/src/App.tsx": "Main router setup that triggers rollback reconciliation before rendering and defines all application routes.",
  "frontend/src/components/AddChapterDialog.tsx": "Dialog component for adding a chapter with form inputs for name, lectures, and hours.",
  "frontend/src/components/AllChaptersBySubjectSection.tsx": "Displays all chapters grouped by subject with status-based sectioning and counts.",
  "frontend/src/components/AnimatedIcon.tsx": "Wraps a Lucide icon with optional active animation and sizing.",
  "frontend/src/components/AppErrorBoundary.tsx": "Provides a React error boundary with UI for showing errors, stack traces, and recovery actions.",
  "frontend/src/components/BottomNavigation.tsx": "Renders a fixed bottom navigation bar containing the SubjectsBar.",
  "frontend/src/components/ChapterCard.tsx": "Shows a chapter card with status, timers, and controls for starting, pausing, and stopping work.",
  "frontend/src/components/ChapterDetailPanel.tsx": "Sheet panel for editing chapter details, hours, lectures, and status with inline form controls.",
  "frontend/src/components/DashboardCompletionDistributionChart.tsx": "Renders a bar chart showing chapter completion percentages per subject.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout including header, navigation, customization panel, and identity controls.",
  "frontend/src/components/MonthGridCalendar.tsx": "Renders a month-view calendar grid with navigation and optional day indicators. Calculates dates across previous, current, and next months to fill the grid.",
  "frontend/src/components/NotificationsSection.tsx": "Displays incomplete chapters, todos, and today's calendar entries with counts. Pulls data from multiple hooks and organizes them into notification lists.",
  "frontend/src/components/OverallPerformanceTrendChart.tsx": "Computes test score trends using linear regression and renders a performance chart. Shows average percentage, recent scores, and trend indicators.",
  "frontend/src/components/PageTransition.tsx": "Adds a fade transition when the route changes. Tracks path changes and toggles opacity during transitions.",
  "frontend/src/components/ResourceSidebar.tsx": "Manages subject-specific resources with add and delete actions. Displays a list of resources and a form to create new ones.",
  "frontend/src/components/RollbackTargetSafeguard.tsx": "Provides a confirmation dialog requiring explicit version input before rollback. Validates user input and blocks unsafe rollback actions.",
  "frontend/src/components/ShareAppLinkDialog.tsx": "Shows a dialog for sharing the current app URL with copy-to-clipboard support. Includes a link to open the app in a new tab.",
  "frontend/src/components/SubjectCompletionGraph.tsx": "Displays subject completion stats with an animated progress bar and per‑chapter completion grid tracking newly completed chapters.",
  "frontend/src/components/SubjectDeleteButton.tsx": "Provides a delete button with a confirmation dialog and toast feedback for removing a subject.",
  "frontend/src/components/SubjectsBar.tsx": "Renders a horizontal subject navigation bar with add/delete subject actions and active subject highlighting.",
  "frontend/src/components/SubjectsSelector.tsx": "Implements a popover dropdown for selecting or creating subjects with inline validation.",
  "frontend/src/components/TasksDrawer.tsx": "A slide‑in drawer offering navigation links and a subject‑scoped todo list with add, toggle, and delete actions.",
  "frontend/src/components/TestScoreChart.tsx": "Renders a responsive SVG chart showing test scores as a line or bar graph with scaling, gridlines, and data points.",
  "frontend/src/components/TodoList.tsx": "Renders a to‑do list for a subject with add, toggle, and delete functionality using the useTodos hook.",
  "frontend/src/customization/applyDarkModeOverride.ts": "Applies light or dark mode by toggling the root HTML class based on override settings.",
  "frontend/src/customization/CustomizationButton.tsx": "Small settings button that triggers opening the customization panel.",
  "frontend/src/customization/CustomizationPanel.tsx": "Right‑side settings panel allowing users to adjust theme, study goals, playback speed, and other customization options.",
  "frontend/src/customization/CustomizationProvider.tsx": "Provides customization settings context, syncing settings and applying dark‑mode overrides.",
  "frontend/src/customization/integration.ts": "Utility functions for notifications, sleep window checks, chapter card density, and study time calculations.",
  "frontend/src/customization/settingsModel.ts": "Defines customization settings schema, default values, and validation for persisted settings.",
  "frontend/src/customization/useCustomizationPresets.ts": "Manages saving, loading, applying, and deleting named customization presets in localStorage.",
  "frontend/src/customization/useCustomizationSettings.ts": "Loads, persists, updates, and resets user customization settings with versioned localStorage support.",
  "frontend/src/data/chapters.ts": "Defines chapter structure and provides an initial list of chapters with lecture counts and statuses.",
  "frontend/src/data/subjects.ts": "Defines subjects, maps subjects to icons, and includes helpers for icon lookup and legacy routing.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCalendarEntries.ts": "Manages calendar entries with localStorage persistence, providing CRUD functions keyed by date.",
  "frontend/src/hooks/useChapterData.ts": "Loads, saves, updates, and syncs chapter data across tabs with versioning and status updates.",
  "frontend/src/hooks/useCountdownTarget.ts": "Stores and retrieves a single countdown target date in localStorage with validation.",
  "frontend/src/hooks/useCountdownTimer.ts": "Computes live countdown time to a target date and updates every second.",
  "frontend/src/hooks/useCountdownTimers.ts": "Handles multiple countdown timers with schema validation, migration, selection, and robust localStorage management.",
  "frontend/src/hooks/useCurrentlyWorkingChapters.ts": "Tracks per‑chapter work sessions with timers, pause/resume state, migration, and cross‑tab syncing.",
  "frontend/src/hooks/useDashboardInside.ts": "Empty placeholder file.",
  "frontend/src/hooks/useDashboardNote.ts": "Stores a dashboard note in localStorage and syncs updates automatically.",
  "frontend/src/hooks/useDashboardTitle.ts": "Manages a persistent dashboard title with versioned localStorage storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity login, identity loading, state tracking, and AuthClient setup.",
  "frontend/src/hooks/useNotes.ts": "Manages a list of notes with localStorage persistence and functions to add, update, and delete notes.",
  "frontend/src/hooks/useQueries.ts": "Provides a placeholder React hook for backend queries and currently just returns actor state from useActor.",
  "frontend/src/hooks/useResources.ts": "Manages subject-specific resources with localStorage persistence and migration from legacy formats.",
  "frontend/src/hooks/useStudyLog.ts": "Stores and updates study log entries in localStorage and triggers sleep-window warnings based on settings.",
  "frontend/src/hooks/useSubjectDetails.ts": "Handles per-subject metadata with versioned localStorage and functions to get and update details.",
  "frontend/src/hooks/useSubjects.ts": "Manages the subjects list with migration from older storage formats and supports add, delete, and lookup.",
  "frontend/src/hooks/useTests.ts": "Maintains a collection of tests and scores with localStorage, supporting CRUD operations and chart settings.",
  "frontend/src/hooks/useTodos.ts": "Provides subject-scoped todo storage with legacy migration and localStorage syncing.",
  "frontend/src/hooks/useTodosAll.ts": "Loads and watches all todos across subjects by listening to localStorage changes.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables, dark mode colors, animations, and utility classes.",
  "frontend/src/lib/appLocalStorage.ts": "Defines all app-specific localStorage keys and provides helpers to clear or retrieve them.",
  "frontend/src/lib/appVersion.ts": "Stores version metadata for v37 and manages rollback target validation and persistence.",
  "frontend/src/lib/rollbackRestore.ts": "Controls rollback-to-v37 logic, including activation, reconciliation, and state tracking using localStorage.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CalendarDashboard.tsx": "Implements a calendar dashboard with month navigation and per-day work item CRUD operations.",
  "frontend/src/pages/CountdownTimer.manual-test.md": "Manual QA checklist covering creation, editing, deletion, and persistence of countdown timers.",
  "frontend/src/pages/CountdownTimer.tsx": "UI and logic for managing multiple countdown timers, including selection, editing, deletion, and target date updates.",
  "frontend/src/pages/Customize.tsx": "Customization panel for subjects, appearance settings, presets, and rollback-to-v37 controls.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing stats, active chapters, editable title and note, and charts using various hooks.",
  "frontend/src/pages/Notes.tsx": "Notes page providing CRUD operations for user notes with editing, viewing, and deletion UI.",
  "frontend/src/pages/SubjectPage.tsx": "Subject detail page displaying chapters, subject metadata, editing tools, and work‑tracking controls.",
  "frontend/src/pages/Tests.tsx": "Tests page managing tests, scores, charts, and editing/creation flows for performance tracking.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, containers, and plugins.",
  "project_state.json": "Project state metadata tracking rollback‑related requirements, known issues, and feature definitions."
}