{
  "backend/main.mo": "Implements a reminder actor with CRUD-style operations, tracking IDs and storing reminders in a map with completion and cancellation flags.",
  "backend/migration.mo": "Defines legacy-compatible types and a trivial migration function that returns the old actor state unchanged.",
  "feature_evidence.json": "Lists feature evidence metadata linking feature IDs to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing major frontend components, pages, customization system, and data modules.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme CSS variables and applying base UI styling.",
  "frontend/index.html": "HTML entry point that pre-applies dark mode based on stored customization settings before loading React.",
  "frontend/public/study-planner-mockup.html": "Standalone static mockup page using CDN React to visualize a themed Study Planner UI layout.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for dashboard, subjects, utilities, customization, and wraps the app in an error boundary.",
  "frontend/src/components/AddChapterDialog.tsx": "Dialog component for adding chapters, capturing name, lectures, and hours, and submitting via a callback.",
  "frontend/src/components/AllChaptersBySubjectSection.tsx": "Renders subjects with grouped chapter lists by status and completion counts using chapter and subject data hooks.",
  "frontend/src/components/AnimatedIcon.tsx": "Wraps a Lucide icon with optional active animation and size control.",
  "frontend/src/components/AppErrorBoundary.tsx": "Provides a React error boundary with UI for displaying errors, stack traces, and reset or navigation actions.",
  "frontend/src/components/BottomNavigation.tsx": "Displays a fixed bottom navigation bar containing the SubjectsBar component.",
  "frontend/src/components/ChapterCard.tsx": "Shows chapter details with status badge, timers, and work controls, including live elapsed time tracking.",
  "frontend/src/components/ChapterDetailPanel.tsx": "A slide-in panel for viewing and editing chapter details, lectures, hours, and status with persistence via hooks.",
  "frontend/src/components/DashboardCompletionDistributionChart.tsx": "Generates a bar chart showing chapter completion percentages per subject.",
  "frontend/src/components/Layout.tsx": "Defines the app’s main layout with header, navigation, customization panel, identity controls, and routed content.",
  "frontend/src/components/MonthGridCalendar.tsx": "Renders a navigable month-view calendar grid with selectable dates and optional entry indicators.",
  "frontend/src/components/NotificationsSection.tsx": "Displays notifications for incomplete chapters, todos, and today's calendar entries.",
  "frontend/src/components/OverallPerformanceTrendChart.tsx": "Calculates score trends and renders a performance line chart with trend indicators.",
  "frontend/src/components/PageTransition.tsx": "Applies a fade transition when the router path changes.",
  "frontend/src/components/ResourceSidebar.tsx": "Shows subject resources with the ability to add or delete resource entries.",
  "frontend/src/components/RollbackTargetSafeguard.tsx": "Provides a confirmation dialog requiring explicit version input before allowing rollback operations.",
  "frontend/src/components/ShareAppLinkDialog.tsx": "Opens a dialog to copy or open a shareable link to the current app URL.",
  "frontend/src/components/SubjectCompletionGraph.tsx": "Computes chapter completion stats and renders an animated progress bar and chapter grid with newly completed highlighting.",
  "frontend/src/components/SubjectDeleteButton.tsx": "Shows a confirmation dialog to delete a subject and triggers deletion with success toast notifications.",
  "frontend/src/components/SubjectsBar.tsx": "Displays a horizontal subject list with navigation, add/delete actions, and active subject highlighting.",
  "frontend/src/components/SubjectsSelector.tsx": "Provides a popover selector for navigating between subjects and adding new ones with validation.",
  "frontend/src/components/TasksDrawer.tsx": "Implements a slide-in menu with navigation links and subject-scoped task management features.",
  "frontend/src/components/TestScoreChart.tsx": "Renders a responsive SVG chart showing test scores as a line or bar graph with scales, gridlines, and data points.",
  "frontend/src/components/TodoList.tsx": "Renders a to-do list for a subject with add, toggle, and delete functionality using a custom todos hook.",
  "frontend/src/customization/applyDarkModeOverride.ts": "Applies or removes the document dark mode class based on override settings.",
  "frontend/src/customization/CustomizationButton.tsx": "A small icon button that triggers opening the customization settings panel.",
  "frontend/src/customization/CustomizationPanel.tsx": "Right-side settings sheet allowing users to adjust theme, study goals, lecture speed, sleep window, and other preferences.",
  "frontend/src/customization/CustomizationProvider.tsx": "Provides customization settings context, syncing changes and applying dark mode overrides.",
  "frontend/src/customization/integration.ts": "Contains helper functions for notifications, sleep window checks, chapter display density, and study target calculations.",
  "frontend/src/customization/settingsModel.ts": "Defines customization settings schema, defaults, and validation logic.",
  "frontend/src/customization/useCustomizationPresets.ts": "Manages saving, loading, applying, and deleting user-defined customization presets in local storage.",
  "frontend/src/customization/useCustomizationSettings.ts": "Loads, saves, and updates global customization settings with local storage persistence.",
  "frontend/src/data/chapters.ts": "Provides the chapter model and a long predefined list of initial chapters with metadata.",
  "frontend/src/data/subjects.ts": "Defines default subjects, icon mappings, and legacy route/name maps for compatibility.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useCalendarEntries.ts": "Manages calendar entries with localStorage persistence, providing CRUD helpers grouped by date keys.",
  "frontend/src/hooks/useChapterData.ts": "Loads, saves, and syncs chapter data across tabs with versioned storage and update helpers.",
  "frontend/src/hooks/useCountdownTarget.ts": "Handles a single countdown target date with validation and localStorage persistence.",
  "frontend/src/hooks/useCountdownTimer.ts": "Computes live countdown values to a given target date, updating every second.",
  "frontend/src/hooks/useCountdownTimers.ts": "Manages multiple countdown timers with schema validation, migration, selection, and robust localStorage handling.",
  "frontend/src/hooks/useCurrentlyWorkingChapters.ts": "Tracks chapter work sessions with timers, persistence, cross-tab sync, and elapsed-time helpers.",
  "frontend/src/hooks/useDashboardInside.ts": "Empty hook file with no implementation.",
  "frontend/src/hooks/useDashboardNote.ts": "Stores and updates a dashboard note string with versioned localStorage.",
  "frontend/src/hooks/useDashboardTitle.ts": "Stores and updates a dashboard title with versioned localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login flow, persistence, and context via Dfinity AuthClient.",
  "frontend/src/hooks/useNotes.ts": "Manages a notes list with add, update, delete operations and localStorage persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides a placeholder hook for future backend React Query integration, currently returning actor state.",
  "frontend/src/hooks/useResources.ts": "Manages per-subject study resources with localStorage persistence and migration from legacy formats.",
  "frontend/src/hooks/useStudyLog.ts": "Tracks study log entries in localStorage and triggers sleep-window warnings when logging time.",
  "frontend/src/hooks/useSubjectDetails.ts": "Stores and updates per-subject details like lecture count and targets with versioned localStorage.",
  "frontend/src/hooks/useSubjects.ts": "Handles subject list management with migration, add/delete operations, and persistence.",
  "frontend/src/hooks/useTests.ts": "Manages tests and scores with add/update/delete operations and chart settings stored in localStorage.",
  "frontend/src/hooks/useTodos.ts": "Provides per-subject todo management with migration from legacy data and localStorage syncing.",
  "frontend/src/hooks/useTodosAll.ts": "Reads all todos across subjects from storage and refreshes on storage changes.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, color themes, utilities, animations, and custom UI effects.",
  "frontend/src/lib/appLocalStorage.ts": "Defines all localStorage keys used by the app and utility functions to clear or retrieve them.",
  "frontend/src/lib/appVersion.ts": "Stores app version metadata and provides helpers for rollback validation and persistence.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Entry point that initializes React, React Query, and the Internet Identity provider, then renders the app.",
  "frontend/src/pages/CalendarDashboard.tsx": "Implements a calendar dashboard with month navigation and daily work item CRUD operations.",
  "frontend/src/pages/CountdownTimer.manual-test.md": "Manual test checklist covering creation, selection, renaming, deletion, and persistence of countdown timers.",
  "frontend/src/pages/CountdownTimer.tsx": "UI and logic for managing multiple countdown timers, including creation, editing, deletion, and live countdown display.",
  "frontend/src/pages/Customize.tsx": "Customization page for managing subjects, display and study settings, and user presets with rollback info.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard showing study stats, active chapters, customization-driven metrics, and editable title/note.",
  "frontend/src/pages/Notes.tsx": "Implements a notes page with create, edit, delete, and selection functionality using local note state and UI components.",
  "frontend/src/pages/SubjectPage.tsx": "Renders a subject detail view with chapter management, subject metadata editing, progress tracking, and navigation controls.",
  "frontend/src/pages/Tests.tsx": "Provides UI for managing tests, editing details, adding scores, and visualizing performance through charts.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, color variables, typography, container settings, and animation plugins.",
  "project_state.json": "Defines current project metadata, requested rollback features, and project state for deployment version restoration."
}