{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted list of summaries for many frontend files describing their functionality and UI behavior.",
  "frontend/index.css": "Tailwind CSS setup defining extensive light/dark theme CSS variables and base styles.",
  "frontend/index.html": "HTML entrypoint loading fonts, syncing dark mode from localStorage, and mounting the React app.",
  "frontend/public/study-planner-mockup.html": "Standalone mockup HTML with inline styles and CDN React for a styled study planner UI demo.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for dashboards, subjects, and utility pages with Layout and error boundary.",
  "frontend/src/components/AddChapterDialog.tsx": "Dialog component for adding a chapter with form inputs for name, lecture count, and duration.",
  "frontend/src/components/AllChaptersBySubjectSection.tsx": "Displays subjects with their completed and incomplete chapters, grouped and visually separated with status badges.",
  "frontend/src/components/AnimatedIcon.tsx": "Wraps a Lucide icon with simple active-state animation styling.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that shows error details and provides actions to recover or reset local data.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar that lists core routes and dynamically adds subject links with active state styling.",
  "frontend/src/components/ChapterCard.tsx": "Chapter card with timers, status display, manual time entries, editing controls, and work session management.",
  "frontend/src/components/ChapterDetailPanel.tsx": "Slide-in panel for editing chapter fields, updating status, and viewing computed targets and metadata.",
  "frontend/src/components/DashboardCompletionDistributionChart.tsx": "Renders a bar chart summarizing completion percentages across subjects.",
  "frontend/src/components/Layout.tsx": "App layout with header, page transitions, customization panel, and bottom navigation.",
  "frontend/src/components/MonthGridCalendar.tsx": "Renders a navigable month grid calendar with selectable days and optional entry indicators.",
  "frontend/src/components/NotificationsSection.tsx": "Aggregates incomplete chapters, todos, and today’s calendar entries into a notifications card.",
  "frontend/src/components/OverallPerformanceTrendChart.tsx": "Computes test score trends and displays a performance line chart with trend indicators.",
  "frontend/src/components/PageTransition.tsx": "Provides a fade transition wrapper that reacts to router path changes.",
  "frontend/src/components/ResourceSidebar.tsx": "Displays and manages a list of subject-specific resources with add and delete actions.",
  "frontend/src/components/SubjectCompletionGraph.tsx": "Shows subject chapter completion stats with a progress bar and chapter grid, highlighting newly completed items.",
  "frontend/src/components/SubjectDeleteButton.tsx": "Provides a confirmation dialog and toast feedback for deleting a subject and its chapters.",
  "frontend/src/components/TasksDrawer.tsx": "Drawer component showing navigation and subject-specific tasks with add, toggle, and delete functionality.",
  "frontend/src/components/TestScoreChart.tsx": "Renders a responsive SVG chart (line or bar) visualizing test scores with scaling, grid lines, and tooltips.",
  "frontend/src/components/TodoList.tsx": "Displays a subject’s to-do list with task creation, completion toggling, and deletion inside a card layout.",
  "frontend/src/customization/applyDarkModeOverride.ts": "Applies or removes the dark mode class on the document root based on user override settings.",
  "frontend/src/customization/CustomizationButton.tsx": "A simple icon button that opens the customization settings panel.",
  "frontend/src/customization/CustomizationPanel.tsx": "Side panel UI for modifying study settings like target hours, speed, sleep window, and visual preferences.",
  "frontend/src/customization/CustomizationProvider.tsx": "Context provider managing customization settings, draft edits, and dark mode override application.",
  "frontend/src/customization/integration.ts": "Utility functions for notifications, sleep window checks, card density, and target-hour/date calculations.",
  "frontend/src/customization/settingsModel.ts": "Defines customization settings, defaults, and a validator ensuring values stay within valid ranges.",
  "frontend/src/customization/useCustomizationPresets.ts": "Manages saving, loading, applying, and deleting named customization presets with localStorage persistence.",
  "frontend/src/customization/useCustomizationSettings.ts": "React hook for loading, validating, updating, and persisting UI customization settings in localStorage.",
  "frontend/src/data/chapters.ts": "Defines chapter data structures and exports a large initial list of chapters with metadata for all subjects.",
  "frontend/src/data/subjects.ts": "Defines subject metadata plus legacy route and name mappings for backward compatibility.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCalendarEntries.ts": "Manages calendar notes stored per date with load, save, add, update, and delete operations in localStorage.",
  "frontend/src/hooks/useChapterData.ts": "Loads, saves, syncs, and mutates chapter progress data across tabs using localStorage and the storage event.",
  "frontend/src/hooks/useCurrentlyWorkingChapters.ts": "Tracks active chapter work sessions with timing, pause/resume, persistence, and version migration.",
  "frontend/src/hooks/useDashboardNote.ts": "Loads, saves, and updates a simple dashboard note string in localStorage.",
  "frontend/src/hooks/useDashboardTitle.ts": "Loads, saves, and updates the dashboard title with localStorage persistence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login flow, and stored identity handling via AuthClient.",
  "frontend/src/hooks/useNotes.ts": "Manages note creation, updating, deletion, and persisted storage with versioning. Syncs notes to localStorage and generates timestamps and unique IDs.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and loading state for future backend React Query integrations.",
  "frontend/src/hooks/useResources.ts": "Manages subject-specific resources with migration from legacy formats and versioned localStorage. Supports adding and deleting resources while maintaining global storage consistency.",
  "frontend/src/hooks/useStudyLog.ts": "Handles study log entries with persistence, daily hour calculation, and sleep-window notifications. Adds timestamped entries and syncs them to localStorage.",
  "frontend/src/hooks/useSubjectDetails.ts": "Stores and updates per-subject metadata like goals and dates using versioned localStorage. Exposes getters and updaters for subject details.",
  "frontend/src/hooks/useSubjects.ts": "Manages subject list persistence with add/delete and duplicate prevention. Loads defaults and stores versioned subjects in localStorage.",
  "frontend/src/hooks/useTests.ts": "Manages test definitions and scores with chart settings, stored in versioned localStorage. Supports adding, editing, scoring, and deleting tests.",
  "frontend/src/hooks/useTodos.ts": "Manages subject-specific todos with migration from legacy formats and versioned persistence. Allows adding, toggling, and deleting todos.",
  "frontend/src/hooks/useTodosAll.ts": "Provides access to all todos across subjects, reloading from localStorage on storage events. Exposes a getter for the full todo list.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables plus background overlays and global base styles.",
  "frontend/src/lib/appLocalStorage.ts": "Provides centralized management of app-specific LocalStorage keys with reset and accessor utilities.",
  "frontend/src/lib/utils.ts": "Exports a `cn` helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/CalendarDashboard.tsx": "Implements a calendar dashboard with monthly navigation and per‑day to‑do entry management.",
  "frontend/src/pages/Customize.tsx": "Provides UI for editing customization settings, managing presets, and adding or deleting subjects and chapters.",
  "frontend/src/pages/Dashboard.tsx": "Displays study stats, active chapters, editable dashboard title/note, and a hero section with charts and notifications.",
  "frontend/src/pages/Notes.tsx": "Implements a notes interface supporting creation, editing, selection, and deletion of text notes.",
  "frontend/src/pages/SubjectPage.tsx": "Implements the subject detail page, handling chapter listing, editing subject metadata, chapter CRUD, and time‑tracking controls. Uses multiple hooks and UI components to manage state, navigation, and interactions.",
  "frontend/src/pages/Tests.tsx": "Provides UI for creating, editing, and deleting tests and scores, with validation, chart settings, and expandable test sections. Relies on useTests for data operations and displays performance graphs.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, shadows, and enabling plugins for typography, container queries, and animations. Sets up dark mode and file content paths for class scanning.",
  "project_state.json": "Stores project metadata, requirements, issues, image needs, and feature descriptions for an ongoing study‑tracker UI/UX rebuild. Acts as a centralized state file guiding fixes and enhancements."
}