{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and base styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "App router configuration defining all routes and rendering Layout via TanStack Router.",
  "frontend/src/components/AddChapterDialog.tsx": "Dialog component allowing users to add a new chapter with name, lecture count, and duration.",
  "frontend/src/components/BottomNavigation.tsx": "Mobile-friendly bottom navigation bar with subject tabs and links to home, calendar, tests, and customize.",
  "frontend/src/components/ChapterCard.tsx": "Displays a chapter card with status, lecture info, elapsed time, and start/stop working controls.",
  "frontend/src/components/ChapterDetailPanel.tsx": "Shows detailed chapter info in a side panel, including target hours, finish date, and status update actions.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header, navigation, customization panel, and routed content area.",
  "frontend/src/components/MonthGridCalendar.tsx": "Renders a navigable monthly calendar grid with selectable dates and optional day indicators.",
  "frontend/src/components/ResourceSidebar.tsx": "Provides a resource list for a subject with add and delete functionality inside a sidebar card.",
  "frontend/src/components/TasksDrawer.tsx": "Implements a slide-out menu with navigation and subject-specific task management including add, toggle, and delete.",
  "frontend/src/components/TestScoreChart.tsx": "Renders a score chart for a test, building an SVG line or bar chart from sorted score data.",
  "frontend/src/components/TodoList.tsx": "Displays a subject-specific todo list with add, toggle, and delete actions using useTodos.",
  "frontend/src/customization/applyDarkModeOverride.ts": "Applies light or dark mode to the document root based on override settings.",
  "frontend/src/customization/CustomizationButton.tsx": "Provides a small settings button that triggers opening the customization panel.",
  "frontend/src/customization/CustomizationPanel.tsx": "Shows a settings panel with sliders, inputs, and toggles to adjust study customization preferences.",
  "frontend/src/customization/CustomizationProvider.tsx": "Context provider managing customization settings, draft settings, and dark mode overrides.",
  "frontend/src/customization/integration.ts": "Utility functions for notifications, sleep-window checks, card density, target-hour calculation, and finish-date estimation.",
  "frontend/src/customization/settingsModel.ts": "Defines customization settings, defaults, and a validator to sanitize updates.",
  "frontend/src/customization/useCustomizationPresets.ts": "Manages saving, loading, applying, and deleting user-defined customization presets in localStorage.",
  "frontend/src/customization/useCustomizationSettings.ts": "Loads, updates, validates, and persists customization settings with reset support.",
  "frontend/src/data/chapters.ts": "Exports chapter definitions and initial chapter list with metadata for multiple subjects.",
  "frontend/src/data/subjects.ts": "Defines subject types, default subjects, and legacy route/name mappings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCalendarEntries.ts": "Manages calendar entries with localStorage persistence and CRUD operations.",
  "frontend/src/hooks/useChapterData.ts": "Loads, migrates, and stores chapter data with versioning and supports adding and updating chapters.",
  "frontend/src/hooks/useCurrentlyWorkingChapters.ts": "Tracks currently active chapters with timers and persists state in localStorage.",
  "frontend/src/hooks/useDashboardNote.ts": "Stores and updates a single dashboard note in localStorage.",
  "frontend/src/hooks/useDashboardTitle.ts": "Manages a customizable dashboard title with localStorage persistence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useNotes.ts": "Manages a list of notes with add, update, and delete operations stored in localStorage.",
  "frontend/src/hooks/useQueries.ts": "Stub for backend React Query hooks, exposing the actor.",
  "frontend/src/hooks/useResources.ts": "Loads, migrates, and stores subject-specific resources with add/delete support and default fallbacks.",
  "frontend/src/hooks/useStudyLog.ts": "Manages study log entries in localStorage, allowing adding hours with optional sleep-window notifications and computing today’s total hours.",
  "frontend/src/hooks/useSubjects.ts": "Loads, stores, and manages subjects with versioned localStorage, supporting adding subjects and lookups by id or name.",
  "frontend/src/hooks/useTests.ts": "Handles creation and management of tests and score entries using versioned localStorage, including chart settings updates.",
  "frontend/src/hooks/useTodos.ts": "Manages subject-specific todos with migration from legacy formats and synchronized versioned storage.",
  "frontend/src/index.css": "Defines Tailwind base, component, and utility layers with light/dark theme CSS variables and responsive container rules.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/CalendarDashboard.tsx": "Implements a calendar dashboard with month navigation and daily work-item CRUD using custom calendar entry hooks.",
  "frontend/src/pages/Customize.tsx": "Provides a customization UI for settings, presets, preview modes, and subject management with form handling and toasts.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with chapter stats, countdown timer, active chapter timers, subject creation, and editable title/note fields.",
  "frontend/src/pages/Notes.tsx": "Provides a notes interface with creation, editing, deletion, and list browsing using local note persistence.",
  "frontend/src/pages/SubjectPage.tsx": "Displays a subject’s chapters, todos, and resources with chapter timers, detail panels, and chapter creation.",
  "frontend/src/pages/Tests.tsx": "Implements test management including creating tests, recording/editing scores, and viewing charts with customizable colors.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugin setup for the project.",
  "project_state.json": "Stores project metadata, architecture notes, existing features, and known issues for build planning."
}