{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of frontend React components and utilities.",
  "frontend/index.css": "TailwindCSS setup defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "Root HTML file loading fonts and mounting the React app at the #root element.",
  "frontend/src/App.tsx": "Configures TanStack Router with all app routes and renders the router provider.",
  "frontend/src/components/AddChapterDialog.tsx": "Dialog component allowing users to create a new chapter with name, lecture count, and duration.",
  "frontend/src/components/AllChaptersBySubjectSection.tsx": "Lists all chapters grouped by subject with completion indicators and badges.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays error details and provides reset and reload controls.",
  "frontend/src/components/BottomNavigation.tsx": "Renders a bottom navigation bar with home, subjects, calendar, tests, and customization buttons, using route state to highlight the active item.",
  "frontend/src/components/ChapterCard.tsx": "Displays a chapter card with status, target hours, and work session controls, including adding, editing, and deleting time entries.",
  "frontend/src/components/ChapterDetailPanel.tsx": "Shows a detailed chapter panel with editable fields, status updates, and calculated target hours and finish dates.",
  "frontend/src/components/Layout.tsx": "Defines the app layout with header, outlet, bottom navigation, and customization panel within a provider.",
  "frontend/src/components/MonthGridCalendar.tsx": "Generates a month-view calendar grid with date selection, navigation, and optional day indicators.",
  "frontend/src/components/OverallPerformanceTrendChart.tsx": "Aggregates test scores into a trend chart, computes trend direction via regression, and renders a performance line graph.",
  "frontend/src/components/ResourceSidebar.tsx": "A sidebar component that lists resources for a subject and allows adding or deleting items using useResources.",
  "frontend/src/components/SubjectCompletionGraph.tsx": "Displays subject completion stats with a progress bar and chapter grid, including animations for newly completed chapters.",
  "frontend/src/components/TasksDrawer.tsx": "A slide-out menu providing navigation and a subject-specific task manager with add, toggle, and delete functionality.",
  "frontend/src/components/TestScoreChart.tsx": "Renders a line or bar chart of test scores using SVG scaling logic with support for multiple attempts.",
  "frontend/src/components/TodoList.tsx": "Shows a subject-specific todo list with add, toggle, and delete actions powered by useTodos.",
  "frontend/src/customization/applyDarkModeOverride.ts": "Applies dark mode classes based on user override settings or defaults to dark mode.",
  "frontend/src/customization/CustomizationButton.tsx": "A simple icon button that triggers opening the customization panel.",
  "frontend/src/customization/CustomizationPanel.tsx": "A settings panel allowing users to adjust study preferences like target hours, speed factor, and sleep window.",
  "frontend/src/customization/CustomizationProvider.tsx": "Provides customization settings context with update and reset abilities, applying dark mode overrides.",
  "frontend/src/customization/integration.ts": "Provides utility functions for notification checks, sleep window logic, UI density, and calculating study hours and finish dates based on customization settings.",
  "frontend/src/customization/settingsModel.ts": "Defines the customization settings schema, default values, and a validator that clamps and normalizes incoming settings.",
  "frontend/src/customization/useCustomizationPresets.ts": "Implements a hook for loading, saving, applying, and deleting user-defined settings presets with localStorage persistence.",
  "frontend/src/customization/useCustomizationSettings.ts": "Provides a hook for loading, updating, and resetting customization settings with versioned localStorage storage.",
  "frontend/src/data/chapters.ts": "Defines chapter data structures and initializes a large predefined chapter list with metadata such as lectures, duration, and subject.",
  "frontend/src/data/subjects.ts": "Provides subject definitions plus legacy route and name mappings for backward compatibility.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCalendarEntries.ts": "Manages per‑date calendar notes with CRUD helpers and versioned localStorage persistence.",
  "frontend/src/hooks/useChapterData.ts": "Loads, migrates, updates, and persists chapter data with cross‑tab synchronization via a custom event.",
  "frontend/src/hooks/useCurrentlyWorkingChapters.ts": "Tracks active chapter work sessions with timing, pause/resume logic, migration handling, and persistent state storage.",
  "frontend/src/hooks/useDashboardNote.ts": "Manages a dashboard note string with versioned localStorage persistence and exposes note state setters.",
  "frontend/src/hooks/useDashboardTitle.ts": "Stores and retrieves a dashboard title from localStorage with versioning and default fallback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context-based Internet Identity auth client with login, logout, status tracking, and identity persistence.",
  "frontend/src/hooks/useNotes.ts": "Handles CRUD operations for notes and persists them in versioned localStorage.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and fetching status for future backend queries.",
  "frontend/src/hooks/useResources.ts": "Manages subject-specific resources with migration from legacy formats and synced localStorage storage.",
  "frontend/src/hooks/useStudyLog.ts": "Tracks study log entries, persists them, and triggers sleep-window notifications on logging.",
  "frontend/src/hooks/useSubjects.ts": "Manages subject list with add and lookup helpers, persisting data in localStorage.",
  "frontend/src/hooks/useTests.ts": "Maintains tests with scores, chart settings, and CRUD operations stored in localStorage.",
  "frontend/src/hooks/useTodos.ts": "Manages subject-scoped todos with migration from legacy formats and versioned localStorage storage.",
  "frontend/src/index.css": "Sets up Tailwind layers, defines light/dark theme CSS variables, global base styles, a horizontal scroll utility, and a slow-fill animation.",
  "frontend/src/lib/utils.ts": "Exports a cn helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, and loads global CSS.",
  "frontend/src/pages/CalendarDashboard.tsx": "Implements a calendar dashboard with month navigation and a per‑day work item list supporting add, edit, and delete.",
  "frontend/src/pages/Customize.tsx": "Provides a customization screen for UI settings, presets, preview modes, and subject management.",
  "frontend/src/pages/Dashboard.tsx": "Displays study stats, timers, active chapters, and dashboard notes with subject and chapter integration.",
  "frontend/src/pages/Notes.tsx": "Implements a notes manager with creation, editing, selection, and deletion features.",
  "frontend/src/pages/SubjectPage.tsx": "Shows a subject’s chapters, todos, and resources with chapter timers and chapter creation support.",
  "frontend/src/pages/Tests.tsx": "React page for managing tests with CRUD for tests and scores plus charts and UI state handling.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata outlining app purpose, architecture, known issues, and existing features for build planning."
}