{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing dashboard Inside-section changes and associated files.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files and components.",
  "frontend/index.css": "Tailwind base/theme variables and dark‑mode CSS definitions.",
  "frontend/index.html": "HTML entrypoint with early dark‑mode sync script and React mount point.",
  "frontend/public/study-planner-mockup.html": "Standalone static mockup showing a styled Study Planner UI using CDN React.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for dashboard, subjects, and utility pages.",
  "frontend/src/components/AddChapterDialog.tsx": "Dialog component for adding a chapter with fields for name, lecture count, and duration.",
  "frontend/src/components/AllChaptersBySubjectSection.tsx": "Lists subjects with completed and incomplete chapters using badges and icons.",
  "frontend/src/components/AnimatedIcon.tsx": "Wrapper that adds active animation styling around Lucide icons.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays error details and offers home navigation, reload, and local data reset options.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar that builds nav items from static routes and subjects, highlighting the active path.",
  "frontend/src/components/ChapterCard.tsx": "Card UI for a chapter with timers, status display, working session controls, and manual entry management.",
  "frontend/src/components/ChapterDetailPanel.tsx": "Slide-out panel showing detailed chapter info with status updates and editable lecture and target-hour fields.",
  "frontend/src/components/DashboardCompletionDistributionChart.tsx": "Displays per-subject chapter completion stats as a bar-style distribution chart.",
  "frontend/src/components/Layout.tsx": "Main app layout with header, customization panel, page transitions, and optional bottom navigation.",
  "frontend/src/components/MonthGridCalendar.tsx": "Generates a full month grid with navigation, date selection, and optional entry indicators.",
  "frontend/src/components/NotificationsSection.tsx": "Aggregates incomplete chapters, todos, and today's calendar entries to display notification counts and lists inside a styled card.",
  "frontend/src/components/OverallPerformanceTrendChart.tsx": "Computes test score trends, average performance, and renders a custom SVG line chart with trend indicators.",
  "frontend/src/components/PageTransition.tsx": "Wraps page content with a fade transition triggered by route changes.",
  "frontend/src/components/ResourceSidebar.tsx": "Displays subject resources with add and delete functionality using a sidebar-style card.",
  "frontend/src/components/SubjectCompletionGraph.tsx": "Calculates chapter completion stats and renders an animated progress bar and chapter grid visualization.",
  "frontend/src/components/SubjectDeleteButton.tsx": "Provides a confirmation dialog to delete a subject and shows a toast on success.",
  "frontend/src/components/TasksDrawer.tsx": "Implements a slide-in drawer for navigation and subject-specific todo management, including add, toggle, and delete actions.",
  "frontend/src/components/TestScoreChart.tsx": "Renders a responsive line or bar chart for test scores with SVG scales, grid lines, and interactive points.",
  "frontend/src/components/TodoList.tsx": "Displays a subject-specific todo list with add, toggle, and delete functionality using useTodos.",
  "frontend/src/customization/applyDarkModeOverride.ts": "Applies light or dark mode to the document root based on override settings.",
  "frontend/src/customization/CustomizationButton.tsx": "Provides a small settings button that triggers opening the customization panel.",
  "frontend/src/customization/CustomizationPanel.tsx": "UI panel allowing users to adjust theme, study settings, and other customization options via sliders, toggles, and inputs.",
  "frontend/src/customization/CustomizationProvider.tsx": "Provides customization settings context, syncing dark mode and managing draft settings.",
  "frontend/src/customization/integration.ts": "Contains helper functions for notifications, sleep window checks, card density, and target-hour/date calculations.",
  "frontend/src/customization/settingsModel.ts": "Defines customization settings schema, defaults, and validation logic.",
  "frontend/src/customization/useCustomizationPresets.ts": "Manages saving, loading, applying, and deleting user-defined customization presets in localStorage.",
  "frontend/src/customization/useCustomizationSettings.ts": "Loads, saves, validates, and updates user customization settings with versioned localStorage.",
  "frontend/src/data/chapters.ts": "Defines chapter types and provides an initial list of chapters for multiple subjects with metadata like lectures, duration, and status.",
  "frontend/src/data/subjects.ts": "Defines subjects and legacy mappings for routes and names used for compatibility and migration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useCalendarEntries.ts": "Manages calendar entries with localStorage persistence and provides CRUD helpers for date-keyed notes.",
  "frontend/src/hooks/useChapterData.ts": "Stores and syncs chapter data in localStorage, supports updates, additions, deletions, and cross-tab synchronization.",
  "frontend/src/hooks/useCurrentlyWorkingChapters.ts": "Tracks active chapter work sessions with timing, pause/resume, persistence, and version migration.",
  "frontend/src/hooks/useDashboardInside.ts": "Stores a single dashboard content string in localStorage with load/save logic.",
  "frontend/src/hooks/useDashboardNote.ts": "Stores a dashboard note string in localStorage with automatic persistence.",
  "frontend/src/hooks/useDashboardTitle.ts": "Manages dashboard title persistence in localStorage with a default title.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity management via Internet Identity, including login, logout, state tracking, and context access.",
  "frontend/src/hooks/useNotes.ts": "Manages note CRUD operations with localStorage persistence and versioning.",
  "frontend/src/hooks/useQueries.ts": "Provides a placeholder hook exposing actor and fetch status for future backend queries.",
  "frontend/src/hooks/useResources.ts": "Handles subject-specific resources with migration logic, defaults, and localStorage syncing.",
  "frontend/src/hooks/useStudyLog.ts": "Tracks study log entries, persists them, and triggers sleep-window warnings.",
  "frontend/src/hooks/useSubjectDetails.ts": "Stores and updates per-subject metadata like lectures and target hours using localStorage.",
  "frontend/src/hooks/useSubjects.ts": "Manages subject list CRUD with duplicate checks and persistent storage.",
  "frontend/src/hooks/useTests.ts": "Manages tests, scores, and chart settings with full CRUD and localStorage persistence.",
  "frontend/src/hooks/useTodos.ts": "Handles per-subject todos with migration from legacy data and persistent storage.",
  "frontend/src/hooks/useTodosAll.ts": "Provides access to all todos with automatic reloading on storage changes.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables and base styles.",
  "frontend/src/lib/appLocalStorage.ts": "Provides a list of app-specific LocalStorage keys and helpers to clear or retrieve them.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/src/pages/CalendarDashboard.tsx": "Implements a calendar dashboard with a month grid and daily to‑do entries, including add/edit/delete actions.",
  "frontend/src/pages/Customize.tsx": "Provides a customization panel for UI settings, presets, and subject management with save/apply logic.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard showing stats, active chapters, editable title/note, and related widgets.",
  "frontend/src/pages/Notes.tsx": "Implements a notes manager with create, edit, delete, and viewing functionality.",
  "frontend/src/pages/SubjectPage.tsx": "Renders the subject detail page with chapter management, editing subject metadata, time tracking, and navigation logic.",
  "frontend/src/pages/Tests.tsx": "Implements test and score management UI with creation, editing, deletion, and performance chart settings.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, container settings, and plugin integrations.",
  "project_state.json": "Stores project metadata including features, versions, and configuration notes for the dashboard enhancement project."
}