{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping two chapter‑status‑toggle features to the ChapterDetailPanel file.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing major frontend components and pages.",
  "frontend/index.css": "Tailwind CSS base file defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "HTML entry point that preloads dark mode from localStorage before mounting the React app.",
  "frontend/public/study-planner-mockup.html": "Standalone static mockup page using CDN React to demonstrate UI styling and layout concepts.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all main pages and wraps the app with an error boundary.",
  "frontend/src/components/AddChapterDialog.tsx": "Modal dialog for adding a new chapter with name, lecture count, and duration inputs.",
  "frontend/src/components/AllChaptersBySubjectSection.tsx": "Displays chapters grouped by subject with completed and not‑completed lists and status badges.",
  "frontend/src/components/AnimatedIcon.tsx": "Wrapper that renders a Lucide icon with optional active animation styling.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches render errors and shows a recovery UI with options to navigate home, reload, or clear local data.",
  "frontend/src/components/BottomNavigation.tsx": "Bottom navigation bar that builds dynamic nav items from subjects and highlights the active route.",
  "frontend/src/components/ChapterCard.tsx": "Card component for displaying and managing chapter progress, timers, status, and manual working time entries.",
  "frontend/src/components/ChapterDetailPanel.tsx": "Slide-out panel for editing detailed chapter fields, updating status, and recalculating target hours and finish dates.",
  "frontend/src/components/DashboardCompletionDistributionChart.tsx": "Renders a bar chart summarizing chapter completion percentages per subject.",
  "frontend/src/components/Layout.tsx": "App layout that wraps pages with header, customization panel, navigation, and page transitions.",
  "frontend/src/components/MonthGridCalendar.tsx": "Generates a month-view calendar grid with navigation controls and optional day indicators.",
  "frontend/src/components/NotificationsSection.tsx": "Displays incomplete chapters, todos, and today's calendar entries with counts and item details.",
  "frontend/src/components/OverallPerformanceTrendChart.tsx": "Processes test score history to compute trend and renders an SVG performance line chart with stats.",
  "frontend/src/components/PageTransition.tsx": "Applies fade and slide transition when the route path changes.",
  "frontend/src/components/ResourceSidebar.tsx": "Shows a subject’s resource list with add and delete functionality.",
  "frontend/src/components/SubjectCompletionGraph.tsx": "Calculates subject chapter completion stats and renders a progress bar and chapter grid with animations.",
  "frontend/src/components/SubjectDeleteButton.tsx": "Provides a confirmation dialog to delete a subject and triggers toast feedback.",
  "frontend/src/components/TasksDrawer.tsx": "A slide‑in menu for navigation and subject-specific todos with add, toggle, and delete actions.",
  "frontend/src/components/TestScoreChart.tsx": "Renders a line or bar chart for test scores using SVG with scaling, grid lines, and interactive points.",
  "frontend/src/components/TodoList.tsx": "Displays a subject-specific to‑do list with add, toggle, and delete actions using local todo hooks.",
  "frontend/src/customization/applyDarkModeOverride.ts": "Applies light or dark mode to the document root based on override settings.",
  "frontend/src/customization/CustomizationButton.tsx": "Provides a button that opens customization settings via an onClick handler.",
  "frontend/src/customization/CustomizationPanel.tsx": "UI panel for editing customization settings like theme, targets, and speed using sliders, toggles, and inputs.",
  "frontend/src/customization/CustomizationProvider.tsx": "Context provider managing customization settings, drafts, and dark mode application.",
  "frontend/src/customization/integration.ts": "Utility functions for notifications, sleep-window checks, UI density, and calculating target hours and finish dates.",
  "frontend/src/customization/settingsModel.ts": "Defines customization settings schema, defaults, and a validator enforcing bounds and fallbacks.",
  "frontend/src/customization/useCustomizationPresets.ts": "Manages saving, loading, applying, and deleting user-defined customization presets in localStorage.",
  "frontend/src/customization/useCustomizationSettings.ts": "Loads, updates, validates, and persists core customization settings in localStorage.",
  "frontend/src/data/chapters.ts": "Defines Chapter types and initializes a large list of chapter data for multiple subjects.",
  "frontend/src/data/subjects.ts": "Defines subject metadata with defaults and legacy mappings for routes and names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useCalendarEntries.ts": "Manages calendar entry CRUD with localStorage persistence.",
  "frontend/src/hooks/useChapterData.ts": "Loads, syncs, and updates chapter data with localStorage and cross-tab synchronization.",
  "frontend/src/hooks/useCountdownTarget.ts": "Stores and updates a countdown target date in localStorage.",
  "frontend/src/hooks/useCountdownTimer.ts": "Computes live time remaining until a target date, updating every second.",
  "frontend/src/hooks/useCurrentlyWorkingChapters.ts": "Tracks active chapter work sessions with pause/resume and localStorage persistence.",
  "frontend/src/hooks/useDashboardInside.ts": "Stores simple dashboard content text in localStorage.",
  "frontend/src/hooks/useDashboardNote.ts": "Stores and updates a dashboard note in localStorage.",
  "frontend/src/hooks/useDashboardTitle.ts": "Stores and updates a dashboard title in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identity state, and handling AuthClient creation and status flags.",
  "frontend/src/hooks/useNotes.ts": "Manages a list of notes in localStorage with add, update, and delete operations.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor state for future backend React Query integrations.",
  "frontend/src/hooks/useResources.ts": "Handles subject-specific resource lists with localStorage persistence and legacy migration, supporting add and delete.",
  "frontend/src/hooks/useStudyLog.ts": "Tracks study log entries with timestamps, saves them to localStorage, and triggers sleep-window alerts.",
  "frontend/src/hooks/useSubjectDetails.ts": "Stores and updates per-subject metadata like lecture counts and target hours in localStorage.",
  "frontend/src/hooks/useSubjects.ts": "Manages the list of subjects with persistence and supports adding, deleting, and lookup by id or name.",
  "frontend/src/hooks/useTests.ts": "Maintains tests with scores, chart settings, and CRUD operations persisted in localStorage.",
  "frontend/src/hooks/useTodos.ts": "Manages per-subject todos with localStorage persistence and legacy migration, supporting add, toggle, and delete.",
  "frontend/src/hooks/useTodosAll.ts": "React hook that loads, watches, and returns all todos from versioned localStorage.",
  "frontend/src/index.css": "Tailwind base styles with extensive light/dark mode CSS variables and global layout rules.",
  "frontend/src/lib/appLocalStorage.ts": "Utility defining all app-specific localStorage keys and functions to clear or list them.",
  "frontend/src/lib/utils.ts": "Provides a cn helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, identity provider, and renders the root App component.",
  "frontend/src/pages/CalendarDashboard.tsx": "Calendar dashboard page showing a month grid and daily to‑do list with CRUD for calendar entries.",
  "frontend/src/pages/CountdownTimer.tsx": "Countdown timer page allowing users to set a target datetime and view live countdown values.",
  "frontend/src/pages/Customize.tsx": "Customization UI for themes, presets, and subjects with settings editing and preset management.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing chapter stats, active work, notes, and customizable title/content.",
  "frontend/src/pages/Notes.tsx": "Implements a notes manager with creation, editing, deletion, and selection logic tied to useNotes.",
  "frontend/src/pages/SubjectPage.tsx": "Renders a subject detail view with chapter management, subject metadata editing, timers, and related UI panels.",
  "frontend/src/pages/Tests.tsx": "Provides test and score management with CRUD operations, charts, and customizable chart colors.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, containers, and plugin integrations for the project.",
  "project_state.json": "Describes project state, issues, and feature requirements for chapter status selection behavior."
}