{
  "kind": "build_request",
  "title": "Rollback deployment to version 37 (undo latest deployed changes)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the application (frontend and backend) to match the exact behavior and code that was deployed as version 37, undoing all changes introduced in the latest deployment(s) (e.g., versions 38–40).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Undo latest deployment changes (restore to 37 version)"
        ]
      },
      "acceptanceCriteria": [
        "After deployment, the app reports and/or is labeled as version 37 (or an unambiguous equivalent identifier mapped to version 37).",
        "The deployed frontend and backend behavior matches version 37 and does not include changes introduced after version 37.",
        "No new data migrations run as part of this rollback unless version 37 requires a different stable state schema (in which case the rollback includes a safe, tested migration plan)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "If the system cannot uniquely identify or reproduce version 37 from available build/deployment metadata, add a safeguard that blocks rollback until an explicit target version identifier is provided/confirmed (e.g., v37, v38, v39, v40, or a commit hash), and ensure the rollback action uses that exact identifier.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Undo latest deployment changes (restore to 37 version)"
        ]
      },
      "acceptanceCriteria": [
        "When rollback target is ambiguous, the rollback process fails closed (does not deploy anything) and clearly indicates that an explicit target version identifier is required.",
        "Once a valid explicit target identifier for version 37 is provided/confirmed, the system performs the restore using that exact identifier and records/logs which version was restored.",
        "User-facing text for any prompts/confirmations is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if state upgrade/downgrade requires it per the conditional migration policy.",
    "Do not edit files under frontend/src/components/ui or any frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Adding new product features unrelated to restoring version 37.",
    "Refactoring or redesigning UI beyond what is necessary to match version 37.",
    "Introducing external databases, third-party auth providers, or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}