{
  "kind": "build_request",
  "title": "Allow chapter status selection to be changed or cleared in Chapter Details",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Chapter Details status controls (Completed / Incomplete / Tough) so the user can deselect a previously selected status and revert the chapter status back to \"Not Started\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "when i open chapter detials then if i select completed or incomplete or tough options there is only going front but no renwing option if i select any one of the three the i can deselect any  three"
        ]
      },
      "acceptanceCriteria": [
        "In ChapterDetailPanel, if the chapter is currently \"Completed\", \"Incomplete\", or \"Tough\", the user can clear that selection and set the status back to \"Not Started\" without needing to refresh or leave the panel.",
        "The status UI no longer blocks the user from undoing a status choice (i.e., there is an explicit way to reset/clear, or clicking the active selection toggles it off).",
        "After clearing the status, the status badge in the Chapter Detail panel updates immediately to show \"Not Started\".",
        "Status changes (including clearing to \"Not Started\") persist the same way as other chapter status updates (via the existing localStorage-backed chapter data)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Chapter Details status controls so the user can switch between statuses freely (Completed / Incomplete / Tough) without the UI disabling the currently selected option in a way that prevents re-selection behavior (needed for toggle-to-clear).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "if i select any one of the three the i can deselect any  three"
        ]
      },
      "acceptanceCriteria": [
        "The status buttons in ChapterDetailPanel are not implemented in a way that prevents the user from clicking the currently-selected status when toggle-to-clear is supported.",
        "A user can set status to Completed, then change to Incomplete, then change to Tough, and the badge reflects each change immediately.",
        "A user can set any of the three statuses and then clear back to \"Not Started\" using the supported interaction."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components); compose them from feature components only.",
    "Keep the existing chapter status enum values unchanged: \"Not Started\", \"Incomplete\", \"Tough\", \"Completed\"."
  ],
  "nonGoals": [
    "Do not add backend persistence for chapter status (keep the existing localStorage-based persistence).",
    "Do not redesign unrelated Chapter Details fields (lectures, target hours, date-to-finish) beyond what is necessary to support status deselection."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}