{
  "kind": "build_request",
  "title": "Add per-subject completion graph with animated chapter fill and fix Minified React error #185",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-57",
      "text": "Add a Subject Completion Graph to every Subject page (Mathematics/Physics/Chemistry and any user-created subjects) that visualizes chapter-by-chapter completion for that subject, and animate each chapter’s segment to fill slowly when the chapter becomes Completed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "ALSO ADD A SUBJECT COMPLETION GRAPH  IN ALL SUBJECTS IF COIMPLETED THEN THE GRAPH OF EACH CHAPTER FILLS SLOWLY"
        ]
      },
      "acceptanceCriteria": [
        "On each Subject page, a Subject Completion Graph is displayed above the chapter grid (or another clearly visible location on the page).",
        "The graph represents all chapters for the current subject and clearly distinguishes Completed vs Not Completed chapters (chapter-level granularity, not only an overall %).",
        "When a chapter status changes to Completed, the corresponding segment animates from unfilled to filled with a visibly slow fill effect (not an instant jump).",
        "The graph updates immediately when chapter status changes and reflects persisted LocalStorage state after a reload.",
        "The graph works for default subjects and user-created subjects (subjectId-based).",
        "All user-facing labels related to the graph are in English."
      ]
    },
    {
      "id": "REQ-58",
      "text": "Fix the production runtime crash showing “Minified React error #185” by reproducing it in a non-minified/dev environment to obtain the full error message/stack, identifying the root cause, and implementing a code fix so the error no longer occurs during normal app usage (including navigating between pages and interacting with chapters/settings).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "ALSO IT IS SJOWING A ERROR FIX IT Minified React error #185; visit https://react.dev/errors/185 for the full message or use the non-minified dev environment for full errors and additional helpful warnings."
        ]
      },
      "acceptanceCriteria": [
        "The app no longer throws “Minified React error #185” in production build during normal navigation and interactions.",
        "No new React runtime errors are introduced in the browser console related to the fix.",
        "Subject pages, Dashboard, Customize page, and chapter interactions (including Currently Working controls) remain functional after the fix.",
        "If the fix requires changing component rendering logic, verify that it does not break LocalStorage persistence behavior for chapters/subjects/settings."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under frontend/src/components/ui (read-only Shadcn components).",
    "Do not edit files listed in frontend.immutablePaths (compose/wrap them instead).",
    "Keep the existing dark-mode theme direction and do not introduce a blue/purple theme.",
    "Do not introduce new backend services or databases; continue to use LocalStorage for persistence."
  ],
  "nonGoals": [
    "Adding backend canister APIs for graphs or analytics.",
    "Implementing real-time/multiplayer updates (WebSockets, etc.).",
    "Redesigning unrelated pages beyond what is necessary to add the subject graph and fix the React error."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}