{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deterministic v37 rollback restore with pre-render reconciliation and user verification",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make rollback-to-v37 deterministically clear all app-owned localStorage keys (per appLocalStorage list) while preserving rollback/audit markers, ensuring a clean v37 seeded baseline after reload.",
      "acceptanceCriteria": [
        "When a user confirms rollback to v37, all app-owned localStorage keys listed in frontend/src/lib/appLocalStorage.ts are removed as part of the rollback flow, except rollback/audit markers that must be preserved.",
        "After rollback completes and the app reloads, subjects/chapters/todos/tests/notes/calendar/customization/presets/countdown/work sessions reflect the same seeded/default state as a fresh v37 install (no previously-entered user data remains).",
        "The rollback operation is idempotent: reloading the app again does not reintroduce cleared data and does not repeatedly clear already-clean storage in a way that breaks normal usage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appLocalStorage.ts",
          "operation": "modify",
          "description": "Extend app-localStorage clearing to support deterministic exclusion of specific keys (rollback/audit markers) while still removing every key in STORAGE_KEYS; keep STORAGE_KEYS as the authoritative list referenced by the rollback flow."
        },
        {
          "path": "frontend/src/lib/rollbackRestore.ts",
          "operation": "modify",
          "description": "Update rollback activation/reconciliation logic to clear all app-owned keys deterministically while explicitly preserving rollback/audit markers (e.g., rollback active flag, reconciliation flag, and confirmed rollback target audit record), and ensure the flow is idempotent across reloads."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure rollback reconciliation runs before any routed pages/components can read or persist newer-version localStorage state, so the first rendered UI after rollback reflects the restored v37 baseline.",
      "acceptanceCriteria": [
        "With rollback active, reconciliation runs before child routes/pages that read localStorage render (so those pages only ever see post-reconciliation storage).",
        "After triggering rollback, the header badge continues to show “v37 (Rollback)” and the UI behavior matches the post-reset baseline immediately after the first reload (no intermediate render with stale data)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Invoke rollback reconciliation synchronously before RouterProvider mounts (e.g., during module initialization or at the top of the App component) to prevent any route/page from rendering with pre-reconciled localStorage."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Adjust Layout rollback handling so it does not rely on a post-render useEffect for initial reconciliation (avoiding an intermediate render that can read stale localStorage), while keeping the existing version badge behavior intact. Use existing composed shadcn-ui Badge where relevant; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/rollbackRestore.ts",
          "operation": "modify",
          "description": "Add a pre-render-safe reconciliation helper (used by App/Layout) that guarantees one-time restore semantics without render-time races, and avoids reload loops by using a stable reconciliation marker."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a clear rollback verification panel on the Customize page showing rollback active status and reconciliation completion, with a safe retry action when reconciliation is incomplete.",
      "acceptanceCriteria": [
        "Customize page shows rollback status (active/inactive) and a clear indicator of whether reconciliation is complete when rollback is active.",
        "If rollback is active and reconciliation is not complete, the UI offers an action to retry/force the restore flow that results in a fully restored baseline state after reload.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/rollbackRestore.ts",
          "operation": "modify",
          "description": "Export rollback reconciliation status (read-only) and add a safe 'retry/force restore' function that re-runs the deterministic restore and reloads, preserving rollback/audit markers."
        },
        {
          "path": "frontend/src/pages/Customize.tsx",
          "operation": "modify",
          "description": "Add a user-visible rollback verification section within the existing App Version card: show (1) rollback active/inactive, (2) reconciliation complete/incomplete when active, and (3) a retry/force-restore action when incomplete. Compose existing shadcn-ui primitives (Card, Badge, Button, AlertDialog, etc.) without editing frontend/src/components/ui/*; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}