{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend rollback identification and safeguard (restore UX labeling to v37)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the UI clearly reports version 37 and does not surface post-v37 UI behavior.",
      "acceptanceCriteria": [
        "After deployment, the app reports and/or is labeled as version 37 (or an unambiguous equivalent identifier mapped to version 37).",
        "The deployed frontend and backend behavior matches version 37 and does not include changes introduced after version 37.",
        "No new data migrations run as part of this rollback unless version 37 requires a different stable state schema (in which case the rollback includes a safe, tested migration plan)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appVersion.ts",
          "operation": "create",
          "description": "Create a single source of truth for the frontend’s deployed version identifier (set to 37) and any optional mapping/metadata needed to display it consistently across the UI."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Display the app version label sourced from frontend/src/lib/appVersion.ts in the main (non-/customize) header so users can verify the deployment is version 37 at runtime."
        },
        {
          "path": "frontend/src/pages/Customize.tsx",
          "operation": "modify",
          "description": "Add a read-only “App Version” section that displays the version identifier from frontend/src/lib/appVersion.ts to provide an unambiguous place to confirm the deployed version on the Customize page."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a fail-closed rollback-target confirmation UX when a rollback target cannot be determined unambiguously.",
      "acceptanceCriteria": [
        "When rollback target is ambiguous, the rollback process fails closed (does not deploy anything) and clearly indicates that an explicit target version identifier is required.",
        "Once a valid explicit target identifier for version 37 is provided/confirmed, the system performs the restore using that exact identifier and records/logs which version was restored.",
        "User-facing text for any prompts/confirmations is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RollbackTargetSafeguard.tsx",
          "operation": "create",
          "description": "Create a small UI safeguard component that (when enabled via an explicit flag such as a router search param or build-time value) blocks the rollback-related UI flow until the user provides/confirms an explicit target identifier (e.g., “v37” or a commit hash) in English. Use shadcn-ui dialog/alert primitives already present in the repo to present the confirmation UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Wire RollbackTargetSafeguard into the app shell so it can activate when the rollback target is ambiguous (fail-closed) and only unblock once the explicit identifier is provided/confirmed. Ensure all user-facing prompt/confirmation text is in English. Use shadcn-ui components already available; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/appVersion.ts",
          "operation": "modify",
          "description": "Extend version utilities to support validating a provided explicit target identifier against the expected v37 identifier and to store the last confirmed rollback target locally (for display/audit in the UI), without introducing any new migrations."
        }
      ]
    }
  ]
}