{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Per-subject completion graph with animated chapter fill + fix React error #185",
  "requirements": [
    {
      "id": "REQ-57",
      "summary": "Add a per-subject completion graph on each Subject page that visualizes chapter-level completion and animates newly completed chapters with a slow fill.",
      "acceptanceCriteria": [
        "On each Subject page, a Subject Completion Graph is displayed above the chapter grid (or another clearly visible location on the page).",
        "The graph represents all chapters for the current subject and clearly distinguishes Completed vs Not Completed chapters (chapter-level granularity, not only an overall %).",
        "When a chapter status changes to Completed, the corresponding segment animates from unfilled to filled with a visibly slow fill effect (not an instant jump).",
        "The graph updates immediately when chapter status changes and reflects persisted LocalStorage state after a reload.",
        "The graph works for default subjects and user-created subjects (subjectId-based).",
        "All user-facing labels related to the graph are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SubjectCompletionGraph.tsx",
          "operation": "create",
          "description": "Create a SubjectCompletionGraph component that renders a chapter-by-chapter completion visualization for a given subjectId using current chapter data, with per-segment filled/unfilled styling and a slow fill animation when a chapter transitions to Completed (detect transitions via previous-status tracking). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SubjectPage.tsx",
          "operation": "modify",
          "description": "Wire SubjectCompletionGraph into the Subject page UI above the chapter grid (within the Chapters tab), passing subjectId and the subject-scoped chapters so the graph updates immediately on status changes and reflects LocalStorage-backed state after reload. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-58",
      "summary": "Reproduce and eliminate the production crash (“Minified React error #185”) by capturing the full dev error/stack, fixing the root cause, and ensuring normal navigation/interactions remain stable.",
      "acceptanceCriteria": [
        "The app no longer throws “Minified React error #185” in production build during normal navigation and interactions.",
        "No new React runtime errors are introduced in the browser console related to the fix.",
        "Subject pages, Dashboard, Customize page, and chapter interactions (including Currently Working controls) remain functional after the fix.",
        "If the fix requires changing component rendering logic, verify that it does not break LocalStorage persistence behavior for chapters/subjects/settings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a lightweight React error boundary component to capture runtime crashes and surface a readable fallback in dev/production, preserving the error stack/logging to help reproduce and verify the fix for React error #185. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Wrap the app root with AppErrorBoundary so the full, non-minified error details can be observed in dev (and crashes are contained), supporting reproduction/verification while implementing the underlying fix. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor route component definitions to avoid patterns that can trigger hook order/identity issues under minification (e.g., ensure any hooks used by route components are called in stable, named components rather than ad-hoc inline closures), and implement the identified root-cause fix so error #185 no longer occurs during navigation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SubjectPage.tsx",
          "operation": "modify",
          "description": "Audit and adjust SubjectPage rendering/state patterns implicated by the reproduced stack trace (e.g., ensure stable keys, avoid any conditional hook invocation paths, and keep chapter interaction flows intact) as part of the root-cause fix for React error #185. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Apply the root-cause fix indicated by the reproduced dev stack trace to Dashboard (commonly: remove any conditional hook invocation, stabilize derived state/memoization inputs, and ensure list rendering uses stable keys) and confirm LocalStorage-backed behavior remains unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Customize.tsx",
          "operation": "modify",
          "description": "Apply the root-cause fix indicated by the reproduced dev stack trace to Customize (commonly: remove any conditional hook invocation and stabilize component rendering logic) and confirm settings/subjects persistence remains unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}