{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Chapter Detail status toggle-to-clear and free switching",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Allow clearing an active chapter status in ChapterDetailPanel to revert back to \"Not Started\" and update immediately with existing localStorage persistence.",
      "acceptanceCriteria": [
        "In ChapterDetailPanel, if the chapter is currently \"Completed\", \"Incomplete\", or \"Tough\", the user can clear that selection and set the status back to \"Not Started\" without needing to refresh or leave the panel.",
        "The status UI no longer blocks the user from undoing a status choice (i.e., there is an explicit way to reset/clear, or clicking the active selection toggles it off).",
        "After clearing the status, the status badge in the Chapter Detail panel updates immediately to show \"Not Started\".",
        "Status changes (including clearing to \"Not Started\") persist the same way as other chapter status updates (via the existing localStorage-backed chapter data)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChapterDetailPanel.tsx",
          "operation": "modify",
          "description": "Update the status action handlers to support toggle-to-clear: when the user clicks the currently-selected status (Completed/Incomplete/Tough), call the existing localStorage-backed updateChapterStatus with \"Not Started\" instead of re-applying the same status. Keep the existing ChapterStatus enum values unchanged. Use the shadcn-ui Button components already present for the status controls; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Adjust ChapterDetailPanel status controls so users can switch statuses freely and still click the active status to toggle it off (no disabled active button behavior).",
      "acceptanceCriteria": [
        "The status buttons in ChapterDetailPanel are not implemented in a way that prevents the user from clicking the currently-selected status when toggle-to-clear is supported.",
        "A user can set status to Completed, then change to Incomplete, then change to Tough, and the badge reflects each change immediately.",
        "A user can set any of the three statuses and then clear back to \"Not Started\" using the supported interaction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChapterDetailPanel.tsx",
          "operation": "modify",
          "description": "Remove/replace the current disabled logic on the three status buttons so the active status remains clickable (required for toggle-to-clear), while still visually indicating selection (e.g., via variant/class changes on the existing shadcn-ui Button). Ensure switching between statuses updates immediately in-panel. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}