{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add editable Inside section to Dashboard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new \"Inside\" Dashboard card that supports view/edit with Edit/Save/Cancel interactions and persists text to a dedicated localStorage key.",
      "acceptanceCriteria": [
        "Dashboard shows a new card/section with the title \"Inside\".",
        "The section supports toggling between read-only and edit mode (e.g., Edit/Save/Cancel) consistent with the existing \"Quick Note\" interactions.",
        "The editable content persists across page reloads via localStorage using a new dedicated storage key (not reusing 'dashboard-note' or 'dashboard-title').",
        "All user-facing text in this section is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDashboardInside.ts",
          "operation": "create",
          "description": "Create a new localStorage-backed hook (mirroring the existing useDashboardNote pattern) for the Dashboard \"Inside\" freeform text, using a new dedicated storage key (e.g., 'dashboard-inside') and versioned stored payload."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add an \"Inside\" Card section that uses existing shadcn/ui components (Card, Button, Textarea) and Lucide icons to provide read-only and edit modes with Edit/Save/Cancel controls consistent with the existing \"Quick Note\" behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/appLocalStorage.ts",
          "operation": "modify",
          "description": "Register the new \"Inside\" localStorage key in the app's centralized LocalStorage key list so the app's reset-local-data behavior also clears the new stored content."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Integrate the \"Inside\" section into the existing Dashboard layout in a responsive, non-overlapping placement for mobile and desktop.",
      "acceptanceCriteria": [
        "The \"Inside\" section appears on the Dashboard without overlapping other sections (Stats, Currently Working, Notifications/Charts, Quick Note, Subjects).",
        "The layout remains responsive (no horizontal scrolling or broken grid) on small screens and large screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Adjust the Dashboard layout to place the new \"Inside\" card in a sensible position within the Home page flow (e.g., pairing it with or placing it near \"Quick Note\" using a responsive grid that becomes 1 column on small screens and 2 columns on larger screens), ensuring it does not overlap existing sections."
        }
      ]
    }
  ]
}